[{"name":"No Ability","description":"Does nothing.","shortDescription":"Does nothing.","gen":[1,2,3,4,5,6,7,8]},{"name":"Adaptability","description":"This Pokemon's moves that match one of its types have a same-type attack bonus (STAB) of 2 instead of 1.5.","shortDescription":"This Pokemon's same-type attack bonus (STAB) is 2 instead of 1.5.","gen":[4,5,6,7,8]},{"name":"Aerilate","description":"This Pokemon's Normal-type moves become Flying-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Flying type and have 1.3x power.","gen":[6]},{"name":"Aerilate","description":"This Pokemon's Normal-type moves become Flying-type moves and have their power multiplied by 1.2. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Flying type and have 1.2x power.","gen":[7,8]},{"name":"Aftermath","description":"If this Pokemon is knocked out with a contact move, that move's user loses 1/4 of its maximum HP, rounded down. If any active Pokemon has the Damp Ability, this effect is prevented.","shortDescription":"If this Pokemon is KOed with a contact move, that move's user loses 1/4 its max HP.","gen":[4,5,6,7,8]},{"name":"Air Lock","description":"While this Pokemon is active, the effects of weather conditions are disabled.","shortDescription":"While this Pokemon is active, the effects of weather conditions are disabled.","gen":[3,4,5,6,7,8]},{"name":"Analytic","description":"The power of this Pokemon's move is multiplied by 1.3 if it is the last to move in a turn. Does not affect Doom Desire and Future Sight.","shortDescription":"This Pokemon's attacks have 1.3x power if it is the last to move in a turn.","gen":[5,6,7,8]},{"name":"Anger Point","description":"If this Pokemon, or its substitute, is struck by a critical hit, its Attack is raised by 12 stages.","shortDescription":"If this Pokemon or its substitute takes a critical hit, its Attack is raised 12 stages.","gen":[4]},{"name":"Anger Point","description":"If this Pokemon, but not its substitute, is struck by a critical hit, its Attack is raised by 12 stages.","shortDescription":"If this Pokemon (not its substitute) takes a critical hit, its Attack is raised 12 stages.","gen":[5,6,7,8]},{"name":"Anticipation","description":"On switch-in, this Pokemon is alerted if any opposing Pokemon has an attack that is super effective on this Pokemon, or an OHKO move. Counter, Metal Burst, and Mirror Coat count as attacking moves of their respective types, while Hidden Power, Judgment, Natural Gift, Techno Blast, and Weather Ball are considered Normal-type moves.","shortDescription":null,"gen":[5]},{"name":"Anticipation","description":"On switch-in, this Pokemon is alerted if any opposing Pokemon has an attack that is super effective against this Pokemon, or an OHKO move. Counter, Metal Burst, and Mirror Coat count as attacking moves of their respective types, Hidden Power counts as its determined type, and Judgment, Natural Gift, Techno Blast, and Weather Ball are considered Normal-type moves.","shortDescription":null,"gen":[6]},{"name":"Anticipation","description":"On switch-in, this Pokemon is alerted if any opposing Pokemon has an attack that is super effective on this Pokemon, or an OHKO move. Counter, Metal Burst, and Mirror Coat count as attacking moves of their respective types, Hidden Power counts as its determined type, and Judgment, Multi-Attack, Natural Gift, Revelation Dance, Techno Blast, and Weather Ball are considered Normal-type moves.","shortDescription":"On switch-in, this Pokemon shudders if any foe has a supereffective or OHKO move.","gen":[7,8]},{"name":"Arena Trap","description":"Prevents adjacent opposing Pokemon from choosing to switch out unless they are immune to trapping or are airborne.","shortDescription":"Prevents adjacent foes from choosing to switch unless they are airborne.","gen":[4,5,6,7,8]},{"name":"Aroma Veil","description":"This Pokemon and its allies cannot be affected by Attract, Disable, Encore, Heal Block, Taunt, or Torment.","shortDescription":"Protects user/allies from Attract, Disable, Encore, Heal Block, Taunt, and Torment.","gen":[6,7,8]},{"name":"As One (Glastrier)","description":"The combination of Unnerve and Chilling Neigh.","shortDescription":"The combination of Unnerve and Chilling Neigh.","gen":[8]},{"name":"As One (Spectrier)","description":"The combination of Unnerve and Grim Neigh.","shortDescription":"The combination of Unnerve and Grim Neigh.","gen":[8]},{"name":"Aura Break","description":"While this Pokemon is active, the effects of the Dark Aura and Fairy Aura Abilities are reversed, multiplying the power of Dark- and Fairy-type moves, respectively, by 3/4 instead of 1.33.","shortDescription":"While this Pokemon is active, the Dark Aura and Fairy Aura power modifier is 0.75x.","gen":[6,7,8]},{"name":"Bad Dreams","description":"Causes adjacent opposing Pokemon to lose 1/8 of their maximum HP, rounded down, at the end of each turn if they are asleep.","shortDescription":"Causes sleeping adjacent foes to lose 1/8 of their max HP at the end of each turn.","gen":[4,5,6,7,8]},{"name":"Ball Fetch","description":"No competitive use.","shortDescription":"No competitive use.","gen":[8]},{"name":"Battery","description":"This Pokemon's allies have the power of their special attacks multiplied by 1.3.","shortDescription":"This Pokemon's allies have the power of their special attacks multiplied by 1.3.","gen":[7,8]},{"name":"Battle Armor","description":"This Pokemon cannot be struck by a critical hit.","shortDescription":"This Pokemon cannot be struck by a critical hit.","gen":[3,4,5,6,7,8]},{"name":"Battle Bond","description":"If this Pokemon is a Greninja, it transforms into Ash-Greninja after knocking out a Pokemon. As Ash-Greninja, its Water Shuriken has 20 base power and always hits 3 times.","shortDescription":"After KOing a Pokemon: becomes Ash-Greninja, Water Shuriken: 20 power, hits 3x.","gen":[7,8]},{"name":"Beast Boost","description":"This Pokemon's highest stat is raised by 1 stage if it attacks and knocks out another Pokemon.","shortDescription":"This Pokemon's highest stat is raised by 1 if it attacks and KOes another Pokemon.","gen":[7,8]},{"name":"Berserk","description":"When this Pokemon has more than 1/2 its maximum HP and takes damage from an attack bringing it to 1/2 or less of its maximum HP, its Special Attack is raised by 1 stage. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the move has a secondary effect.","shortDescription":"This Pokemon's Sp. Atk is raised by 1 when it reaches 1/2 or less of its max HP.","gen":[7,8]},{"name":"Big Pecks","description":"Prevents other Pokemon from lowering this Pokemon's Defense stat stage.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's Defense stat stage.","gen":[5,6,7,8]},{"name":"Blaze","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its Fire-type attacks have their power multiplied by 1.5.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's Fire-type attacks have 1.5x power.","gen":[4]},{"name":"Blaze","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Fire-type attack.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's attacking stat is 1.5x with Fire attacks.","gen":[5,6,7,8]},{"name":"Bulletproof","description":"This Pokemon is immune to ballistic moves. Ballistic moves include Bullet Seed, Octazooka, Barrage, Rock Wrecker, Zap Cannon, Acid Spray, Aura Sphere, Focus Blast, and all moves with Ball or Bomb in their name.","shortDescription":"Makes user immune to ballistic moves (Shadow Ball, Sludge Bomb, Focus Blast, etc).","gen":[6,7,8]},{"name":"Cheek Pouch","description":"If this Pokemon eats a Berry, it restores 1/3 of its maximum HP, rounded down, in addition to the Berry's effect.","shortDescription":"If this Pokemon eats a Berry, it restores 1/3 of its max HP after the Berry's effect.","gen":[6,7,8]},{"name":"Chilling Neigh","description":"This Pokemon's Attack is raised by 1 stage if it attacks and knocks out another Pokemon.","shortDescription":"This Pokemon's Attack is raised by 1 stage if it attacks and KOes another Pokemon.","gen":[8]},{"name":"Chlorophyll","description":"If Sunny Day is active, this Pokemon's Speed is doubled.","shortDescription":null,"gen":[7]},{"name":"Chlorophyll","description":"If Sunny Day is active and this Pokemon is not holding Utility Umbrella, this Pokemon's Speed is doubled.","shortDescription":"If Sunny Day is active, this Pokemon's Speed is doubled.","gen":[8]},{"name":"Clear Body","description":"Prevents other Pokemon from lowering this Pokemon's stat stages.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's stat stages.","gen":[3,4,5,6,7,8]},{"name":"Cloud Nine","description":"While this Pokemon is active, the effects of weather conditions are disabled.","shortDescription":"While this Pokemon is active, the effects of weather conditions are disabled.","gen":[4,5,6,7,8]},{"name":"Color Change","description":"This Pokemon's type changes to match the type of the last move that hit it, unless that type is already one of its types. This effect applies after each hit from a multi-hit move. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":null,"gen":[4]},{"name":"Color Change","description":"This Pokemon's type changes to match the type of the last move that hit it, unless that type is already one of its types. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the move has a secondary effect.","shortDescription":"This Pokemon's type changes to the type of a move it's hit by, unless it has the type.","gen":[5,6,7,8]},{"name":"Comatose","description":"This Pokemon cannot be statused, and is considered to be asleep. Moongeist Beam, Sunsteel Strike, and the Mold Breaker, Teravolt, and Turboblaze Abilities cannot ignore this Ability.","shortDescription":"This Pokemon cannot be statused, and is considered to be asleep.","gen":[7,8]},{"name":"Competitive","description":"This Pokemon's Special Attack is raised by 2 stages for each of its stat stages that is lowered by an opposing Pokemon.","shortDescription":"This Pokemon's Sp. Atk is raised by 2 for each of its stats that is lowered by a foe.","gen":[5,6,7,8]},{"name":"Compound Eyes","description":"This Pokemon's moves have their accuracy multiplied by 1.3.","shortDescription":"This Pokemon's moves have their accuracy multiplied by 1.3.","gen":[3,4,5,6,7,8]},{"name":"Contrary","description":"If this Pokemon has a stat stage raised it is lowered instead, and vice versa.","shortDescription":null,"gen":[6]},{"name":"Contrary","description":"If this Pokemon has a stat stage raised it is lowered instead, and vice versa. This Ability does not affect stat stage increases received from Z-Power effects that happen before a Z-Move is used.","shortDescription":"If this Pokemon has a stat stage raised it is lowered instead, and vice versa.","gen":[7,8]},{"name":"Corrosion","description":"This Pokemon can poison or badly poison other Pokemon regardless of their typing.","shortDescription":"This Pokemon can poison or badly poison other Pokemon regardless of their typing.","gen":[7,8]},{"name":"Cotton Down","description":"When this Pokemon is hit by an attack, the Speed of all other Pokemon on the field is lowered by 1 stage.","shortDescription":"If this Pokemon is hit, it lowers the Speed of all other Pokemon on the field 1 stage.","gen":[8]},{"name":"Curious Medicine","description":"On switch-in, this Pokemon's allies have their stat stages reset to 0.","shortDescription":"On switch-in, this Pokemon's allies have their stat stages reset to 0.","gen":[8]},{"name":"Cursed Body","description":"If this Pokemon is hit by an attack, there is a 30% chance that move gets disabled unless one of the attacker's moves is already disabled.","shortDescription":"If this Pokemon is hit by an attack, there is a 30% chance that move gets disabled.","gen":[5,6,7,8]},{"name":"Cute Charm","description":"There is a 1/3 chance a Pokemon making contact with this Pokemon will become infatuated if it is of the opposite gender. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance of infatuating Pokemon of the opposite gender if they make contact.","gen":[3]},{"name":"Cute Charm","description":"There is a 30% chance a Pokemon making contact with this Pokemon will become infatuated if it is of the opposite gender. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance of infatuating Pokemon of the opposite gender if they make contact.","gen":[4]},{"name":"Cute Charm","description":"There is a 30% chance a Pokemon making contact with this Pokemon will become infatuated if it is of the opposite gender.","shortDescription":"30% chance of infatuating Pokemon of the opposite gender if they make contact.","gen":[5,6,7,8]},{"name":"Damp","description":"While this Pokemon is active, Explosion, Self-Destruct, and the Aftermath Ability are prevented from having an effect.","shortDescription":"Prevents Explosion/Self-Destruct/Aftermath while this Pokemon is active.","gen":[6]},{"name":"Damp","description":"While this Pokemon is active, Explosion, Mind Blown, Self-Destruct, and the Aftermath Ability are prevented from having an effect.","shortDescription":"Prevents Explosion/Mind Blown/Self-Destruct/Aftermath while this Pokemon is active.","gen":[7]},{"name":"Damp","description":"While this Pokemon is active, Explosion, Mind Blown, Misty Explosion, Self-Destruct, and the Aftermath Ability are prevented from having an effect.","shortDescription":"Prevents Explosion/Mind Blown/Misty Explosion/Self-Destruct/Aftermath while active.","gen":[8]},{"name":"Dancer","description":"After another Pokemon uses a dance move, this Pokemon uses the same move. Moves used by this Ability cannot be copied again.","shortDescription":"After another Pokemon uses a dance move, this Pokemon uses the same move.","gen":[7,8]},{"name":"Dark Aura","description":"While this Pokemon is active, the power of Dark-type moves used by active Pokemon is multiplied by 1.33.","shortDescription":"While this Pokemon is active, a Dark move used by any Pokemon has 1.33x power.","gen":[6,7,8]},{"name":"Dauntless Shield","description":"On switch-in, this Pokemon's Defense is raised by 1 stage.","shortDescription":"On switch-in, this Pokemon's Defense is raised by 1 stage.","gen":[8]},{"name":"Dazzling","description":"Priority moves used by opposing Pokemon targeting this Pokemon or its allies are prevented from having an effect.","shortDescription":"This Pokemon and its allies are protected from opposing priority moves.","gen":[7,8]},{"name":"Defeatist","description":"While this Pokemon has 1/2 or less of its maximum HP, its Attack and Special Attack are halved.","shortDescription":"While this Pokemon has 1/2 or less of its max HP, its Attack and Sp. Atk are halved.","gen":[5,6,7,8]},{"name":"Defiant","description":"This Pokemon's Attack is raised by 2 stages for each of its stat stages that is lowered by an opposing Pokemon.","shortDescription":"This Pokemon's Attack is raised by 2 for each of its stats that is lowered by a foe.","gen":[5,6,7,8]},{"name":"Delta Stream","description":"On switch-in, the weather becomes strong winds that remove the weaknesses of the Flying type from Flying-type Pokemon. This weather remains in effect until this Ability is no longer active for any Pokemon, or the weather is changed by Desolate Land or Primordial Sea.","shortDescription":"On switch-in, strong winds begin until this Ability is not active in battle.","gen":[6,7,8]},{"name":"Desolate Land","description":"On switch-in, the weather becomes extremely harsh sunlight that prevents damaging Water-type moves from executing, in addition to all the effects of Sunny Day. This weather remains in effect until this Ability is no longer active for any Pokemon, or the weather is changed by Delta Stream or Primordial Sea.","shortDescription":"On switch-in, extremely harsh sunlight begins until this Ability is not active in battle.","gen":[6,7,8]},{"name":"Disguise","description":"If this Pokemon is a Mimikyu, the first hit it takes in battle deals 0 neutral damage. Its disguise is then broken and it changes to Busted Form. Confusion damage also breaks the disguise.","shortDescription":"(Mimikyu only) First hit deals 0 damage, breaks disguise.","gen":[7]},{"name":"Disguise","description":"If this Pokemon is a Mimikyu, the first hit it takes in battle deals 0 neutral damage. Its disguise is then broken, it changes to Busted Form, and it loses 1/8 of its max HP. Confusion damage also breaks the disguise.","shortDescription":"(Mimikyu only) The first hit it takes is blocked, and it takes 1/8 HP damage instead.","gen":[8]},{"name":"Download","description":"On switch-in, this Pokemon's Attack or Special Attack is raised by 1 stage based on the weaker combined defensive stat of all opposing Pokemon. Attack is raised if their Defense is lower, and Special Attack is raised if their Special Defense is the same or lower.","shortDescription":"On switch-in, Attack or Sp. Atk is raised 1 stage based on the foes' weaker Defense.","gen":[4,5,6,7,8]},{"name":"Dragon's Maw","description":"This Pokemon's attacking stat is multiplied by 1.5 while using a Dragon-type attack.","shortDescription":"This Pokemon's attacking stat is multiplied by 1.5 while using a Dragon-type attack.","gen":[8]},{"name":"Drizzle","description":"On switch-in, this Pokemon summons Rain Dance.","shortDescription":"On switch-in, this Pokemon summons Rain Dance.","gen":[3,4,5,6,7,8]},{"name":"Drought","description":"On switch-in, this Pokemon summons Sunny Day.","shortDescription":"On switch-in, this Pokemon summons Sunny Day.","gen":[3,4,5,6,7,8]},{"name":"Dry Skin","description":"This Pokemon is immune to Water-type moves and restores 1/4 of its maximum HP, rounded down, when hit by a Water-type move. The power of Fire-type moves is multiplied by 1.25 when used on this Pokemon. At the end of each turn, this Pokemon restores 1/8 of its maximum HP, rounded down, if the weather is Rain Dance, and loses 1/8 of its maximum HP, rounded down, if the weather is Sunny Day.","shortDescription":null,"gen":[7]},{"name":"Dry Skin","description":"This Pokemon is immune to Water-type moves and restores 1/4 of its maximum HP, rounded down, when hit by a Water-type move. The power of Fire-type moves is multiplied by 1.25 when used on this Pokemon. At the end of each turn, this Pokemon restores 1/8 of its maximum HP, rounded down, if the weather is Rain Dance, and loses 1/8 of its maximum HP, rounded down, if the weather is Sunny Day. If this Pokemon is holding Utility Umbrella, the effects of weather are nullified.","shortDescription":"This Pokemon is healed 1/4 by Water, 1/8 by Rain; is hurt 1.25x by Fire, 1/8 by Sun.","gen":[8]},{"name":"Early Bird","description":"This Pokemon's sleep counter drops by 2 instead of 1.","shortDescription":"This Pokemon's sleep counter drops by 2 instead of 1.","gen":[3,4,5,6,7,8]},{"name":"Effect Spore","description":"10% chance a Pokemon making contact with this Pokemon will be poisoned, paralyzed, or fall asleep. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"10% chance of poison/paralysis/sleep on others making contact with this Pokemon.","gen":[3]},{"name":"Effect Spore","description":"30% chance a Pokemon making contact with this Pokemon will be poisoned, paralyzed, or fall asleep. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"10% chance of poison/paralysis/sleep on others making contact with this Pokemon.","gen":[4]},{"name":"Effect Spore","description":"30% chance a Pokemon making contact with this Pokemon will be poisoned, paralyzed, or fall asleep.","shortDescription":"30% chance of poison/paralysis/sleep on others making contact with this Pokemon.","gen":[5,6,7,8]},{"name":"Electric Surge","description":"On switch-in, this Pokemon summons Electric Terrain.","shortDescription":"On switch-in, this Pokemon summons Electric Terrain.","gen":[7,8]},{"name":"Emergency Exit","description":"When this Pokemon has more than 1/2 its maximum HP and takes damage bringing it to 1/2 or less of its maximum HP, it immediately switches out to a chosen ally. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the move has a secondary effect. This effect applies to both direct and indirect damage, except Curse and Substitute on use, Belly Drum, Pain Split, and confusion damage.","shortDescription":"This Pokemon switches out when it reaches 1/2 or less of its maximum HP.","gen":[7,8]},{"name":"Fairy Aura","description":"While this Pokemon is active, the power of Fairy-type moves used by active Pokemon is multiplied by 1.33.","shortDescription":"While this Pokemon is active, a Fairy move used by any Pokemon has 1.33x power.","gen":[6,7,8]},{"name":"Filter","description":"This Pokemon receives 3/4 damage from supereffective attacks.","shortDescription":"This Pokemon receives 3/4 damage from supereffective attacks.","gen":[4,5,6,7,8]},{"name":"Flame Body","description":"1/3 chance a Pokemon making contact with this Pokemon will be burned. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be burned.","gen":[3]},{"name":"Flame Body","description":"30% chance a Pokemon making contact with this Pokemon will be burned. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be burned.","gen":[4]},{"name":"Flame Body","description":"30% chance a Pokemon making contact with this Pokemon will be burned.","shortDescription":"30% chance a Pokemon making contact with this Pokemon will be burned.","gen":[5,6,7,8]},{"name":"Flare Boost","description":"While this Pokemon is burned, the power of its special attacks is multiplied by 1.5.","shortDescription":"While this Pokemon is burned, its special attacks have 1.5x power.","gen":[5,6,7,8]},{"name":"Flash Fire","description":"This Pokemon is immune to Fire-type moves, as long as it is not frozen. The first time it is hit by a Fire-type move, damage from its Fire-type attacks will be multiplied by 1.5 as long as it remains active and has this Ability. If this Pokemon has a non-volatile status condition, is a Fire type, or has a substitute, Will-O-Wisp will not activate this Ability.","shortDescription":null,"gen":[3]},{"name":"Flash Fire","description":"This Pokemon is immune to Fire-type moves. The first time it is hit by a Fire-type move, its attacking stat is multiplied by 1.5 while using a Fire-type attack as long as it remains active and has this Ability. If this Pokemon is frozen, it cannot be defrosted by Fire-type attacks.","shortDescription":"This Pokemon's Fire attacks do 1.5x damage if hit by one Fire move; Fire immunity.","gen":[4,5,6,7,8]},{"name":"Flower Gift","description":"If Sunny Day is active, the Attack and Special Defense of this Pokemon and its allies are multiplied by 1.5.","shortDescription":"If Sunny Day is active, Attack and Sp. Def of this Pokemon and its allies are 1.5x.","gen":[4,5,6]},{"name":"Flower Gift","description":"If this Pokemon is a Cherrim and Sunny Day is active, it changes to Sunshine Form and the Attack and Special Defense of it and its allies are multiplied by 1.5.","shortDescription":"If Sunny Day is active, Attack and Sp. Def of this Pokemon and its allies are 1.5x.","gen":[7]},{"name":"Flower Gift","description":"If this Pokemon is a Cherrim and Sunny Day is active, it changes to Sunshine Form and the Attack and Special Defense of it and its allies are multiplied by 1.5. If this Pokemon is a Cherrim and it is holding Utility Umbrella, it remains in its regular form and the Attack and Special Defense stats of it and its allies are not boosted. If this Pokemon is a Cherrim in its Sunshine form and is given Utility Umbrella, it will immediately switch back to its regular form. If this Pokemon is a Cherrim holding Utility Umbrella and its item is removed while Sunny Day is active, it will transform into its Sunshine Form. If an ally is holding Utility Umbrella while Cherrim is in its Sunshine Form, they will not receive the Attack and Special Defense boosts.","shortDescription":"If user is Cherrim and Sunny Day is active, it and allies' Attack and Sp. Def are 1.5x.","gen":[8]},{"name":"Flower Veil","description":"Grass-type Pokemon on this Pokemon's side cannot have their stat stages lowered by other Pokemon or have a non-volatile status condition inflicted on them by other Pokemon.","shortDescription":"This side's Grass types can't have stats lowered or status inflicted by other Pokemon.","gen":[6,7,8]},{"name":"Fluffy","description":"This Pokemon receives 1/2 damage from contact moves, but double damage from Fire moves.","shortDescription":"This Pokemon takes 1/2 damage from contact moves, 2x damage from Fire moves.","gen":[7,8]},{"name":"Forecast","description":"If this Pokemon is a Castform, its type changes to the current weather condition's type, except Sandstorm.","shortDescription":null,"gen":[7]},{"name":"Forecast","description":"If this Pokemon is a Castform, its type changes to the current weather condition's type, except Sandstorm. If this Pokemon is holding Utility Umbrella and the weather condition is Sunny Day, Desolate Land, Rain Dance, or Primordial Sea, it will not change types.","shortDescription":"Castform's type changes to the current weather condition's type, except Sandstorm.","gen":[8]},{"name":"Forewarn","description":"On switch-in, this Pokemon is alerted to the move with the highest power, at random, known by an opposing Pokemon.","shortDescription":"On switch-in, this Pokemon is alerted to the foes' move with the highest power.","gen":[4,5,6,7,8]},{"name":"Friend Guard","description":"This Pokemon's allies receive 3/4 damage from other Pokemon's attacks.","shortDescription":"This Pokemon's allies receive 3/4 damage from other Pokemon's attacks.","gen":[5,6,7,8]},{"name":"Frisk","description":"On switch-in, this Pokemon identifies a random foe's held item.","shortDescription":"On switch-in, this Pokemon identifies a random foe's held item.","gen":[5]},{"name":"Frisk","description":"On switch-in, this Pokemon identifies the held items of all opposing Pokemon.","shortDescription":"On switch-in, this Pokemon identifies the held items of all opposing Pokemon.","gen":[6,7,8]},{"name":"Full Metal Body","description":"Prevents other Pokemon from lowering this Pokemon's stat stages. Moongeist Beam, Sunsteel Strike, and the Mold Breaker, Teravolt, and Turboblaze Abilities cannot ignore this Ability.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's stat stages.","gen":[7,8]},{"name":"Fur Coat","description":"This Pokemon's Defense is doubled.","shortDescription":"This Pokemon's Defense is doubled.","gen":[6,7,8]},{"name":"Gale Wings","description":"This Pokemon's Flying-type moves have their priority increased by 1.","shortDescription":"This Pokemon's Flying-type moves have their priority increased by 1.","gen":[6]},{"name":"Gale Wings","description":"If this Pokemon is at full HP, its Flying-type moves have their priority increased by 1.","shortDescription":"If this Pokemon is at full HP, its Flying-type moves have their priority increased by 1.","gen":[7,8]},{"name":"Galvanize","description":"This Pokemon's Normal-type moves become Electric-type moves and have their power multiplied by 1.2. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Electric type and have 1.2x power.","gen":[7,8]},{"name":"Gluttony","description":"When this Pokemon has 1/2 or less of its maximum HP, it uses certain Berries early.","shortDescription":"When this Pokemon has 1/2 or less of its maximum HP, it uses certain Berries early.","gen":[4,5,6,7,8]},{"name":"Gooey","description":"Pokemon making contact with this Pokemon have their Speed lowered by 1 stage.","shortDescription":"Pokemon making contact with this Pokemon have their Speed lowered by 1 stage.","gen":[6,7,8]},{"name":"Gorilla Tactics","description":"This Pokemon's Attack is 1.5x, but it can only select the first move it executes.","shortDescription":"This Pokemon's Attack is 1.5x, but it can only select the first move it executes.","gen":[8]},{"name":"Grass Pelt","description":"If Grassy Terrain is active, this Pokemon's Defense is multiplied by 1.5.","shortDescription":"If Grassy Terrain is active, this Pokemon's Defense is multiplied by 1.5.","gen":[6,7,8]},{"name":"Grassy Surge","description":"On switch-in, this Pokemon summons Grassy Terrain.","shortDescription":"On switch-in, this Pokemon summons Grassy Terrain.","gen":[7,8]},{"name":"Grim Neigh","description":"This Pokemon's Special Attack is raised by 1 stage if it attacks and knocks out another Pokemon.","shortDescription":"This Pokemon's Sp. Atk is raised by 1 stage if it attacks and KOes another Pokemon.","gen":[8]},{"name":"Gulp Missile","description":"If this Pokemon is a Cramorant, it changes forme when it hits a target with Surf or uses the first turn of Dive successfully. It becomes Gulping Form with an Arrokuda in its mouth if it has more than 1/2 of its maximum HP remaining, or Gorging Form with a Pikachu in its mouth if it has 1/2 or less of its maximum HP remaining. If Cramorant gets hit in Gulping or Gorging Form, it spits the Arrokuda or Pikachu at its attacker, even if it has no HP remaining. The projectile deals damage equal to 1/4 of the target's maximum HP, rounded down; this damage is blocked by the Magic Guard Ability but not by a substitute. An Arrokuda also lowers the target's Defense by 1 stage, and a Pikachu paralyzes the target. Cramorant will return to normal if it spits out a projectile, switches out, or Dynamaxes.","shortDescription":"When hit after Surf/Dive, attacker takes 1/4 max HP and -1 Defense or paralysis.","gen":[8]},{"name":"Guts","description":"If this Pokemon has a non-volatile status condition, its Attack is multiplied by 1.5; burn's physical damage halving is ignored.","shortDescription":"If this Pokemon is statused, its Attack is 1.5x; ignores burn halving physical damage.","gen":[3,4,5,6,7,8]},{"name":"Harvest","description":"If the last item this Pokemon used is a Berry, there is a 50% chance it gets restored at the end of each turn. If Sunny Day is active, this chance is 100%.","shortDescription":"If last item used is a Berry, 50% chance to restore it each end of turn. 100% in Sun.","gen":[5,6,7,8]},{"name":"Healer","description":"There is a 30% chance of curing an adjacent ally's non-volatile status condition at the end of each turn.","shortDescription":"30% chance of curing an adjacent ally's status at the end of each turn.","gen":[5,6,7,8]},{"name":"Heatproof","description":"The power of Fire-type attacks against this Pokemon is halved, and burn damage taken is halved.","shortDescription":"The power of Fire-type attacks against this Pokemon is halved; burn damage halved.","gen":[4,5,6,7,8]},{"name":"Heavy Metal","description":"This Pokemon's weight is doubled.","shortDescription":"This Pokemon's weight is doubled.","gen":[5,6,7,8]},{"name":"Honey Gather","description":"No competitive use.","shortDescription":"No competitive use.","gen":[4,5,6,7,8]},{"name":"Huge Power","description":"This Pokemon's Attack is doubled.","shortDescription":"This Pokemon's Attack is doubled.","gen":[4,5,6,7,8]},{"name":"Hunger Switch","description":"If Morpeko, it changes between Full Belly and Hangry Mode at the end of each turn.","shortDescription":"If Morpeko, it changes between Full Belly and Hangry Mode at the end of each turn.","gen":[8]},{"name":"Hustle","description":"This Pokemon's Attack is multiplied by 1.5 and the accuracy of its physical attacks is multiplied by 0.8.","shortDescription":"This Pokemon's Attack is 1.5x and accuracy of its physical attacks is 0.8x.","gen":[3,4,5,6,7,8]},{"name":"Hydration","description":"This Pokemon has its non-volatile status condition cured at the end of each turn if Rain Dance is active.","shortDescription":null,"gen":[7]},{"name":"Hydration","description":"This Pokemon has its non-volatile status condition cured at the end of each turn if Rain Dance is active. If this Pokemon is holding Utility Umbrella, its non-volatile status condition will not be cured.","shortDescription":"This Pokemon has its status cured at the end of each turn if Rain Dance is active.","gen":[8]},{"name":"Hyper Cutter","description":"Prevents other Pokemon from lowering this Pokemon's Attack stat stage.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's Attack stat stage.","gen":[3,4,5,6,7,8]},{"name":"Ice Body","description":"If Hail is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn. This Pokemon takes no damage from Hail.","shortDescription":"If Hail is active, this Pokemon heals 1/16 of its max HP each turn; immunity to Hail.","gen":[4,5,6,7,8]},{"name":"Ice Face","description":"If this Pokemon is an Eiscue, the first physical hit it takes in battle deals 0 neutral damage. Its ice face is then broken and it changes forme to Noice Face. Eiscue regains its Ice Face forme when Hail begins or when Eiscue switches in while Hail is active. Confusion damage also breaks the ice face.","shortDescription":"If Eiscue, the first physical hit it takes deals 0 damage. This effect is restored in Hail.","gen":[8]},{"name":"Ice Scales","description":"This Pokemon receives 1/2 damage from special attacks.","shortDescription":"This Pokemon receives 1/2 damage from special attacks.","gen":[8]},{"name":"Illuminate","description":"No competitive use.","shortDescription":"No competitive use.","gen":[3,4,5,6,7,8]},{"name":"Illusion","description":"When this Pokemon switches in, it appears as the last unfainted Pokemon in its party until it takes direct damage from another Pokemon's attack. This Pokemon's actual level and HP are displayed instead of those of the mimicked Pokemon.","shortDescription":"This Pokemon appears as the last Pokemon in the party until it takes direct damage.","gen":[5,6,7,8]},{"name":"Immunity","description":"This Pokemon cannot be poisoned. Gaining this Ability while poisoned cures it.","shortDescription":"This Pokemon cannot be poisoned. Gaining this Ability while poisoned cures it.","gen":[3,4,5,6,7,8]},{"name":"Imposter","description":"On switch-in, this Pokemon Transforms into the opposing Pokemon that is facing it. If there is no Pokemon at that position, this Pokemon does not Transform.","shortDescription":"On switch-in, this Pokemon Transforms into the opposing Pokemon that is facing it.","gen":[5,6,7,8]},{"name":"Infiltrator","description":"This Pokemon's moves ignore the opposing side's Reflect, Light Screen, Safeguard, and Mist.","shortDescription":"This Pokemon's moves ignore the foe's Reflect, Light Screen, Safeguard, and Mist.","gen":[5]},{"name":"Infiltrator","description":"This Pokemon's moves ignore substitutes and the opposing side's Reflect, Light Screen, Safeguard, and Mist.","shortDescription":"Moves ignore substitutes and the foe's Reflect, Light Screen, Safeguard, and Mist.","gen":[6]},{"name":"Infiltrator","description":"This Pokemon's moves ignore substitutes and the opposing side's Reflect, Light Screen, Safeguard, Mist and Aurora Veil.","shortDescription":"Moves ignore substitutes and foe's Reflect/Light Screen/Safeguard/Mist/Aurora Veil.","gen":[7,8]},{"name":"Innards Out","description":"If this Pokemon is knocked out with a move, that move's user loses HP equal to the amount of damage inflicted on this Pokemon.","shortDescription":"If this Pokemon is KOed with a move, that move's user loses an equal amount of HP.","gen":[7,8]},{"name":"Inner Focus","description":"This Pokemon cannot be made to flinch.","shortDescription":"This Pokemon cannot be made to flinch.","gen":[7]},{"name":"Inner Focus","description":"This Pokemon cannot be made to flinch. Immune to Intimidate.","shortDescription":"This Pokemon cannot be made to flinch. Immune to Intimidate.","gen":[8]},{"name":"Insomnia","description":"This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it.","shortDescription":"This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it.","gen":[3,4,5,6,7,8]},{"name":"Intimidate","description":"On switch-in, this Pokemon lowers the Attack of adjacent opposing Pokemon by 1 stage. Pokemon behind a substitute are immune.","shortDescription":null,"gen":[7]},{"name":"Intimidate","description":"On switch-in, this Pokemon lowers the Attack of adjacent opposing Pokemon by 1 stage. Inner Focus, Oblivious, Own Tempo, Scrappy, and Pokemon behind a substitute are immune.","shortDescription":"On switch-in, this Pokemon lowers the Attack of adjacent opponents by 1 stage.","gen":[8]},{"name":"Intrepid Sword","description":"On switch-in, this Pokemon's Attack is raised by 1 stage.","shortDescription":"On switch-in, this Pokemon's Attack is raised by 1 stage.","gen":[8]},{"name":"Iron Barbs","description":"Pokemon making contact with this Pokemon lose 1/8 of their maximum HP, rounded down.","shortDescription":"Pokemon making contact with this Pokemon lose 1/8 of their max HP.","gen":[5,6,7,8]},{"name":"Iron Fist","description":"This Pokemon's punch-based attacks have their power multiplied by 1.2.","shortDescription":"This Pokemon's punch-based attacks have 1.2x power. Sucker Punch is not boosted.","gen":[4,5,6,7,8]},{"name":"Justified","description":"This Pokemon's Attack is raised by 1 stage after it is damaged by a Dark-type move.","shortDescription":"This Pokemon's Attack is raised by 1 stage after it is damaged by a Dark-type move.","gen":[5,6,7,8]},{"name":"Keen Eye","description":"Prevents other Pokemon from lowering this Pokemon's accuracy stat stage.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's accuracy stat stage.","gen":[5]},{"name":"Keen Eye","description":"Prevents other Pokemon from lowering this Pokemon's accuracy stat stage. This Pokemon ignores a target's evasiveness stat stage.","shortDescription":"This Pokemon's accuracy can't be lowered by others; ignores their evasiveness stat.","gen":[6,7,8]},{"name":"Klutz","description":"This Pokemon's held item has no effect. This Pokemon cannot use Fling successfully. Macho Brace, Power Anklet, Power Band, Power Belt, Power Bracer, Power Lens, and Power Weight still have their effects.","shortDescription":"This Pokemon's held item has no effect, except Macho Brace. Fling cannot be used.","gen":[4,5,6,7,8]},{"name":"Leaf Guard","description":"If Sunny Day is active, this Pokemon cannot gain a non-volatile status condition, but can use Rest normally.","shortDescription":"If Sunny Day is active, this Pokemon cannot be statused, but Rest works normally.","gen":[4,5,6]},{"name":"Leaf Guard","description":"If Sunny Day is active, this Pokemon cannot gain a non-volatile status condition and Rest will fail for it.","shortDescription":"If Sunny Day is active, this Pokemon cannot be statused, but Rest works normally.","gen":[7]},{"name":"Leaf Guard","description":"If Sunny Day is active and this Pokemon is not holding Utility Umbrella, this Pokemon cannot gain a non-volatile status condition and Rest will fail for it.","shortDescription":"If Sunny Day is active, this Pokemon cannot be statused and Rest will fail for it.","gen":[8]},{"name":"Levitate","description":"This Pokemon is immune to Ground-type attacks and the effects of Spikes and the Arena Trap Ability.","shortDescription":"This Pokemon is immune to Ground.","gen":[3]},{"name":"Levitate","description":"This Pokemon is immune to Ground-type attacks and the effects of Spikes, Toxic Spikes, and the Arena Trap Ability. The effects of Gravity, Ingrain, and Iron Ball nullify the immunity.","shortDescription":"This Pokemon is immune to Ground; Gravity/Ingrain/Iron Ball nullify it.","gen":[4]},{"name":"Levitate","description":"This Pokemon is immune to Ground-type attacks and the effects of Spikes, Toxic Spikes, and the Arena Trap Ability. The effects of Gravity, Ingrain, Smack Down, and Iron Ball nullify the immunity.","shortDescription":"This Pokemon is immune to Ground; Gravity/Ingrain/Iron Ball nullify it.","gen":[5]},{"name":"Levitate","description":"This Pokemon is immune to Ground-type attacks and the effects of Spikes, Toxic Spikes, Sticky Web, and the Arena Trap Ability. The effects of Gravity, Ingrain, Smack Down, Thousand Arrows, and Iron Ball nullify the immunity.","shortDescription":"This Pokemon is immune to Ground; Gravity/Ingrain/Smack Down/Iron Ball nullify it.","gen":[6,7,8]},{"name":"Libero","description":"This Pokemon's type changes to match the type of the move it is about to use. This effect comes after all effects that change a move's type.","shortDescription":"This Pokemon's type changes to match the type of the move it is about to use.","gen":[8]},{"name":"Light Metal","description":"This Pokemon's weight is halved.","shortDescription":"This Pokemon's weight is halved.","gen":[5,6,7,8]},{"name":"Lightning Rod","description":"If this Pokemon is not the target of a single-target Electric-type move used by an opposing Pokemon, this Pokemon redirects that move to itself. This effect considers Hidden Power a Normal-type move.","shortDescription":"This Pokemon draws single-target Electric moves used by opponents to itself.","gen":[3]},{"name":"Lightning Rod","description":"If this Pokemon is not the target of a single-target Electric-type move used by another Pokemon, this Pokemon redirects that move to itself.","shortDescription":"This Pokemon draws single-target Electric moves to itself.","gen":[4]},{"name":"Lightning Rod","description":"This Pokemon is immune to Electric-type moves and raises its Special Attack by 1 stage when hit by an Electric-type move. If this Pokemon is not the target of a single-target Electric-type move used by another Pokemon, this Pokemon redirects that move to itself if it is within the range of that move.","shortDescription":"This Pokemon draws Electric moves to itself to raise Sp. Atk by 1; Electric immunity.","gen":[5,6,7,8]},{"name":"Limber","description":"This Pokemon cannot be paralyzed. Gaining this Ability while paralyzed cures it.","shortDescription":"This Pokemon cannot be paralyzed. Gaining this Ability while paralyzed cures it.","gen":[3,4,5,6,7,8]},{"name":"Liquid Ooze","description":"This Pokemon damages those draining HP from it for as much as they would heal.","shortDescription":"This Pokemon damages those draining HP from it for as much as they would heal.","gen":[3,4,5,6,7,8]},{"name":"Liquid Voice","description":"This Pokemon's sound-based moves become Water-type moves. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's sound-based moves become Water type.","gen":[7,8]},{"name":"Long Reach","description":"This Pokemon's attacks do not make contact with the target.","shortDescription":"This Pokemon's attacks do not make contact with the target.","gen":[7,8]},{"name":"Magic Bounce","description":"This Pokemon blocks certain status moves and instead uses the move against the original user.","shortDescription":"This Pokemon blocks certain status moves and bounces them back to the user.","gen":[5,6,7,8]},{"name":"Magic Guard","description":"This Pokemon can only be damaged by direct attacks. Curse and Substitute on use, Belly Drum, Pain Split, Struggle recoil, and confusion damage are considered direct damage. This Pokemon cannot lose its turn because of paralysis, and is unaffected by Toxic Spikes on switch-in.","shortDescription":"This Pokemon can only be damaged by direct attacks, and can't be fully paralyzed.","gen":[4]},{"name":"Magic Guard","description":"This Pokemon can only be damaged by direct attacks. Curse and Substitute on use, Belly Drum, Pain Split, Struggle recoil, and confusion damage are considered direct damage.","shortDescription":"This Pokemon can only be damaged by direct attacks.","gen":[5,6,7,8]},{"name":"Magician","description":"If this Pokemon has no item, it steals the item off a Pokemon it hits with an attack. Does not affect Doom Desire and Future Sight.","shortDescription":"If this Pokemon has no item, it steals the item off a Pokemon it hits with an attack.","gen":[6,7,8]},{"name":"Magma Armor","description":"This Pokemon cannot be frozen. Gaining this Ability while frozen cures it.","shortDescription":"This Pokemon cannot be frozen. Gaining this Ability while frozen cures it.","gen":[3,4,5,6,7,8]},{"name":"Magnet Pull","description":"Prevents adjacent opposing Steel-type Pokemon from choosing to switch out unless they are immune to trapping.","shortDescription":"Prevents adjacent Steel-type foes from choosing to switch.","gen":[3,4,5,6,7,8]},{"name":"Marvel Scale","description":"If this Pokemon has a non-volatile status condition, its Defense is multiplied by 1.5.","shortDescription":"If this Pokemon is statused, its Defense is 1.5x.","gen":[3,4,5,6,7,8]},{"name":"Mega Launcher","description":"This Pokemon's pulse moves have their power multiplied by 1.5. Heal Pulse restores 3/4 of a target's maximum HP, rounded half down.","shortDescription":"This Pokemon's pulse moves have 1.5x power. Heal Pulse heals 3/4 target's max HP.","gen":[6,7,8]},{"name":"Merciless","description":"This Pokemon's attacks are critical hits if the target is poisoned.","shortDescription":"This Pokemon's attacks are critical hits if the target is poisoned.","gen":[7,8]},{"name":"Mimicry","description":"This Pokemon's type changes to match the Terrain. Type reverts when Terrain ends.","shortDescription":"This Pokemon's type changes to match the Terrain. Type reverts when Terrain ends.","gen":[8]},{"name":"Minus","description":"If an active Pokemon has the Plus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active Pokemon has the Plus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[3]},{"name":"Minus","description":"If an active ally has the Plus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active ally has the Plus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[4]},{"name":"Minus","description":"If an active ally has this Ability or the Plus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active ally has this Ability or the Plus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[5,6,7,8]},{"name":"Mirror Armor","description":"When one of this Pokemon's stat stages would be lowered by another Pokemon, that Pokemon's stat stage is lowered instead. This effect does not happen if this Pokemon's stat stage was already -6.","shortDescription":"If this Pokemon's stat stages would be lowered, the attacker's are lowered instead.","gen":[8]},{"name":"Misty Surge","description":"On switch-in, this Pokemon summons Misty Terrain.","shortDescription":"On switch-in, this Pokemon summons Misty Terrain.","gen":[7,8]},{"name":"Mold Breaker","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Battle Armor, Clear Body, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Heatproof, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Lightning Rod, Limber, Magma Armor, Marvel Scale, Motor Drive, Oblivious, Own Tempo, Sand Veil, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, and Wonder Guard. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[4]},{"name":"Mold Breaker","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Battle Armor, Big Pecks, Clear Body, Contrary, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Friend Guard, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[5]},{"name":"Mold Breaker","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[6]},{"name":"Mold Breaker","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[7]},{"name":"Mold Breaker","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Ice Face, Ice Scales, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Mirror Armor, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Pastel Veil, Punk Rock, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":"This Pokemon's moves and their effects ignore the Abilities of other Pokemon.","gen":[8]},{"name":"Moody","description":"This Pokemon has a random stat raised by 2 stages and another stat lowered by 1 stage at the end of each turn.","shortDescription":"Raises a random stat by 2 and lowers another stat by 1 at the end of each turn.","gen":[7]},{"name":"Moody","description":"This Pokemon has a random stat other than accuracy or evasion raised by 2 stages and another stat lowered by 1 stage at the end of each turn.","shortDescription":"Boosts a random stat (except accuracy/evasion) +2 and another stat -1 every turn.","gen":[8]},{"name":"Motor Drive","description":"This Pokemon is immune to Electric-type moves and raises its Speed by 1 stage when hit by an Electric-type move.","shortDescription":"This Pokemon's Speed is raised 1 stage if hit by an Electric move; Electric immunity.","gen":[4,5,6,7,8]},{"name":"Moxie","description":"This Pokemon's Attack is raised by 1 stage if it attacks and knocks out another Pokemon.","shortDescription":"This Pokemon's Attack is raised by 1 stage if it attacks and KOes another Pokemon.","gen":[5,6,7,8]},{"name":"Multiscale","description":"If this Pokemon is at full HP, damage taken from attacks is halved.","shortDescription":"If this Pokemon is at full HP, damage taken from attacks is halved.","gen":[5,6,7,8]},{"name":"Multitype","description":"If this Pokemon is an Arceus, its type changes to match its held Plate.","shortDescription":"If this Pokemon is an Arceus, its type changes to match its held Plate.","gen":[6]},{"name":"Multitype","description":"If this Pokemon is an Arceus, its type changes to match its held Plate or Z-Crystal.","shortDescription":"If this Pokemon is an Arceus, its type changes to match its held Plate or Z-Crystal.","gen":[7,8]},{"name":"Mummy","description":"Pokemon making contact with this Pokemon have their Ability changed to Mummy. Does not affect the Multitype or Stance Change Abilities.","shortDescription":null,"gen":[6]},{"name":"Mummy","description":"Pokemon making contact with this Pokemon have their Ability changed to Mummy. Does not affect a Pokemon which already has Mummy or the Abilities Battle Bond, Comatose, Disguise, Multitype, Power Construct, RKS System, Schooling, Shields Down, Stance Change, and Zen Mode.","shortDescription":null,"gen":[7]},{"name":"Mummy","description":"Pokemon making contact with this Pokemon have their Ability changed to Mummy. Does not affect a Pokemon which already has Mummy or the Abilities As One, Battle Bond, Comatose, Disguise, Gulp Missile, Ice Face, Multitype, Power Construct, RKS System, Schooling, Shields Down, Stance Change, and Zen Mode.","shortDescription":"Pokemon making contact with this Pokemon have their Ability changed to Mummy.","gen":[8]},{"name":"Natural Cure","description":"This Pokemon has its non-volatile status condition cured when it switches out.","shortDescription":"This Pokemon has its non-volatile status condition cured when it switches out.","gen":[3,4,5,6,7,8]},{"name":"Neuroforce","description":"This Pokemon's attacks that are super effective against the target do 1.25x damage.","shortDescription":"This Pokemon's attacks that are super effective against the target do 1.25x damage.","gen":[7,8]},{"name":"Neutralizing Gas","description":"While this Pokemon is active, Abilities have no effect. Does not affect the Abilities As One, Battle Bond, Comatose, Disguise, Gulp Missile, Ice Face, Multitype, Power Construct, RKS System, Schooling, Shields Down, Stance Change, or Zen Mode.","shortDescription":"While this Pokemon is active, Abilities have no effect.","gen":[8]},{"name":"No Guard","description":"Every move used by or against this Pokemon will always hit.","shortDescription":"Every move used by or against this Pokemon will always hit.","gen":[4,5,6,7,8]},{"name":"Normalize","description":"This Pokemon's moves are changed to be Normal type. This effect comes before other effects that change a move's type.","shortDescription":"This Pokemon's moves are changed to be Normal type.","gen":[6]},{"name":"Normalize","description":"This Pokemon's moves are changed to be Normal type and have their power multiplied by 1.2. This effect comes before other effects that change a move's type.","shortDescription":"This Pokemon's moves are changed to be Normal type and have 1.2x power.","gen":[7,8]},{"name":"Oblivious","description":"This Pokemon cannot be infatuated. Gaining this Ability while infatuated cures it.","shortDescription":"This Pokemon cannot be infatuated. Gaining this Ability while infatuated cures it.","gen":[5,6]},{"name":"Oblivious","description":"This Pokemon cannot be infatuated or taunted. Gaining this Ability while affected cures it.","shortDescription":"This Pokemon cannot be infatuated or taunted.","gen":[7]},{"name":"Oblivious","description":"This Pokemon cannot be infatuated or taunted. Gaining this Ability while affected cures it. Immune to Intimidate.","shortDescription":"This Pokemon cannot be infatuated or taunted. Immune to Intimidate.","gen":[8]},{"name":"Overcoat","description":"This Pokemon is immune to damage from Sandstorm or Hail.","shortDescription":"This Pokemon is immune to damage from Sandstorm or Hail.","gen":[5]},{"name":"Overcoat","description":"This Pokemon is immune to powder moves and damage from Sandstorm or Hail.","shortDescription":"This Pokemon is immune to powder moves and damage from Sandstorm or Hail.","gen":[6,7,8]},{"name":"Overgrow","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its Grass-type attacks have their power multiplied by 1.5.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's Grass-type attacks have 1.5x power.","gen":[4]},{"name":"Overgrow","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Grass-type attack.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's attacking stat is 1.5x with Grass attacks.","gen":[5,6,7,8]},{"name":"Own Tempo","description":"This Pokemon cannot be confused. Gaining this Ability while confused cures it.","shortDescription":"This Pokemon cannot be confused.","gen":[7]},{"name":"Own Tempo","description":"This Pokemon cannot be confused. Gaining this Ability while confused cures it. Immune to Intimidate.","shortDescription":"This Pokemon cannot be confused. Immune to Intimidate.","gen":[8]},{"name":"Parental Bond","description":"This Pokemon's damaging moves become multi-hit moves that hit twice. The second hit has its damage halved. Does not affect multi-hit moves or moves that have multiple targets.","shortDescription":"This Pokemon's damaging moves hit twice. The second hit has its damage halved.","gen":[6]},{"name":"Parental Bond","description":"This Pokemon's damaging moves become multi-hit moves that hit twice. The second hit has its damage quartered. Does not affect multi-hit moves or moves that have multiple targets.","shortDescription":"This Pokemon's damaging moves hit twice. The second hit has its damage quartered.","gen":[7,8]},{"name":"Pastel Veil","description":"This Pokemon and its allies cannot be poisoned. On switch-in, cures poisoned allies.","shortDescription":"This Pokemon and its allies cannot be poisoned. On switch-in, cures poisoned allies.","gen":[8]},{"name":"Perish Body","description":"Making contact with this Pokemon starts the Perish Song effect for it and the attacker. This effect does not happen if this Pokemon already has a perish count.","shortDescription":"Making contact with this Pokemon starts the Perish Song effect for it and the attacker.","gen":[8]},{"name":"Pickpocket","description":"If this Pokemon has no item and is hit by a contact move, it steals the attacker's item. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the move has a secondary effect.","shortDescription":"If this Pokemon has no item and is hit by a contact move, it steals the attacker's item.","gen":[5,6,7,8]},{"name":"Pickup","description":"No competitive use.","shortDescription":"No competitive use.","gen":[4]},{"name":"Pickup","description":"If this Pokemon has no item, it finds one used by an adjacent Pokemon this turn.","shortDescription":"If this Pokemon has no item, it finds one used by an adjacent Pokemon this turn.","gen":[5,6,7,8]},{"name":"Pixilate","description":"This Pokemon's Normal-type moves become Fairy-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Fairy type and have 1.3x power.","gen":[6]},{"name":"Pixilate","description":"This Pokemon's Normal-type moves become Fairy-type moves and have their power multiplied by 1.2. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Fairy type and have 1.2x power.","gen":[7,8]},{"name":"Plus","description":"If an active Pokemon has the Minus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active Pokemon has the Minus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[3]},{"name":"Plus","description":"If an active ally has the Minus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active ally has the Minus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[4]},{"name":"Plus","description":"If an active ally has this Ability or the Minus Ability, this Pokemon's Special Attack is multiplied by 1.5.","shortDescription":"If an active ally has this Ability or the Minus Ability, this Pokemon's Sp. Atk is 1.5x.","gen":[5,6,7,8]},{"name":"Poison Heal","description":"If this Pokemon is poisoned, it restores 1/8 of its maximum HP, rounded down, at the end of each turn instead of losing HP.","shortDescription":"This Pokemon is healed by 1/8 of its max HP each turn when poisoned; no HP loss.","gen":[4,5,6,7,8]},{"name":"Poison Point","description":"1/3 chance a Pokemon making contact with this Pokemon will be poisoned. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be poisoned.","gen":[3]},{"name":"Poison Point","description":"30% chance a Pokemon making contact with this Pokemon will be poisoned. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be poisoned.","gen":[4]},{"name":"Poison Point","description":"30% chance a Pokemon making contact with this Pokemon will be poisoned.","shortDescription":"30% chance a Pokemon making contact with this Pokemon will be poisoned.","gen":[5,6,7,8]},{"name":"Poison Touch","description":"This Pokemon's contact moves have a 30% chance of poisoning.","shortDescription":"This Pokemon's contact moves have a 30% chance of poisoning.","gen":[5,6,7,8]},{"name":"Power Construct","description":"If this Pokemon is a Zygarde in its 10% or 50% Forme, it changes to Complete Forme when it has 1/2 or less of its maximum HP at the end of the turn.","shortDescription":"If Zygarde 10%/50%, changes to Complete if at 1/2 max HP or less at end of turn.","gen":[7,8]},{"name":"Power of Alchemy","description":"This Pokemon copies the Ability of an ally that faints. Abilities that cannot be copied are \"No Ability\", Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Illusion, Imposter, Multitype, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, Wonder Guard, and Zen Mode.","shortDescription":null,"gen":[7]},{"name":"Power of Alchemy","description":"This Pokemon copies the Ability of an ally that faints. Abilities that cannot be copied are \"No Ability\", As One, Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Gulp Missile, Hunger Switch, Ice Face, Illusion, Imposter, Multitype, Neutralizing Gas, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, Wonder Guard, and Zen Mode.","shortDescription":"This Pokemon copies the Ability of an ally that faints.","gen":[8]},{"name":"Power Spot","description":"This Pokemon's allies have the power of their moves multiplied by 1.3.","shortDescription":"This Pokemon's allies have the power of their moves multiplied by 1.3.","gen":[8]},{"name":"Prankster","description":"This Pokemon's non-damaging moves have their priority increased by 1.","shortDescription":"This Pokemon's non-damaging moves have their priority increased by 1.","gen":[6]},{"name":"Prankster","description":"This Pokemon's Status moves have priority raised by 1, but Dark types are immune.","shortDescription":"This Pokemon's Status moves have priority raised by 1, but Dark types are immune.","gen":[7,8]},{"name":"Pressure","description":"If this Pokemon is the target of another Pokemon's move, that move loses one additional PP.","shortDescription":"If this Pokemon is the target of a move, that move loses one additional PP.","gen":[4]},{"name":"Pressure","description":"If this Pokemon is the target of an opposing Pokemon's move, that move loses one additional PP.","shortDescription":"If this Pokemon is the target of a foe's move, that move loses one additional PP.","gen":[5,6,7,8]},{"name":"Primordial Sea","description":"On switch-in, the weather becomes heavy rain that prevents damaging Fire-type moves from executing, in addition to all the effects of Rain Dance. This weather remains in effect until this Ability is no longer active for any Pokemon, or the weather is changed by Delta Stream or Desolate Land.","shortDescription":"On switch-in, heavy rain begins until this Ability is not active in battle.","gen":[6,7,8]},{"name":"Prism Armor","description":"This Pokemon receives 3/4 damage from supereffective attacks. Moongeist Beam, Sunsteel Strike, and the Mold Breaker, Teravolt, and Turboblaze Abilities cannot ignore this Ability.","shortDescription":"This Pokemon receives 3/4 damage from supereffective attacks.","gen":[7,8]},{"name":"Propeller Tail","description":"This Pokemon's moves cannot be redirected to a different target by any effect.","shortDescription":"This Pokemon's moves cannot be redirected to a different target by any effect.","gen":[8]},{"name":"Protean","description":"This Pokemon's type changes to match the type of the move it is about to use. This effect comes after all effects that change a move's type.","shortDescription":"This Pokemon's type changes to match the type of the move it is about to use.","gen":[6,7,8]},{"name":"Psychic Surge","description":"On switch-in, this Pokemon summons Psychic Terrain.","shortDescription":"On switch-in, this Pokemon summons Psychic Terrain.","gen":[7,8]},{"name":"Punk Rock","description":"This Pokemon's sound-based moves have their power multiplied by 1.3. This Pokemon takes halved damage from sound-based moves.","shortDescription":"This Pokemon receives 1/2 damage from sound moves. Its own have 1.3x power.","gen":[8]},{"name":"Pure Power","description":"This Pokemon's Attack is doubled.","shortDescription":"This Pokemon's Attack is doubled.","gen":[3,4,5,6,7,8]},{"name":"Queenly Majesty","description":"Priority moves used by opposing Pokemon targeting this Pokemon or its allies are prevented from having an effect.","shortDescription":"This Pokemon and its allies are protected from opposing priority moves.","gen":[7,8]},{"name":"Quick Draw","description":"This Pokemon has a 30% chance to move first in its priority bracket with attacking moves.","shortDescription":"This Pokemon has a 30% chance to move first in its priority bracket with attacking moves.","gen":[8]},{"name":"Quick Feet","description":"If this Pokemon has a non-volatile status condition, its Speed is multiplied by 1.5; the Speed drop from paralysis is ignored.","shortDescription":"If this Pokemon is statused, its Speed is 1.5x; ignores Speed drop from paralysis.","gen":[4,5,6,7,8]},{"name":"Rain Dish","description":"If Rain Dance is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn.","shortDescription":null,"gen":[7]},{"name":"Rain Dish","description":"If Rain Dance is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn. If this Pokemon is holding Utility Umbrella, its HP does not get restored.","shortDescription":"If Rain Dance is active, this Pokemon heals 1/16 of its max HP each turn.","gen":[8]},{"name":"Rattled","description":"This Pokemon's Speed is raised by 1 stage if hit by a Bug-, Dark-, or Ghost-type attack.","shortDescription":"This Pokemon's Speed is raised 1 stage if hit by a Bug-, Dark-, or Ghost-type attack.","gen":[7]},{"name":"Rattled","description":"This Pokemon's Speed is raised by 1 stage if hit by a Bug-, Dark-, or Ghost-type attack, or Intimidate.","shortDescription":"Speed is raised 1 stage if hit by a Bug-, Dark-, or Ghost-type attack, or Intimidated.","gen":[8]},{"name":"Receiver","description":"This Pokemon copies the Ability of an ally that faints. Abilities that cannot be copied are \"No Ability\", Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Illusion, Imposter, Multitype, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, Wonder Guard, and Zen Mode.","shortDescription":null,"gen":[7]},{"name":"Receiver","description":"This Pokemon copies the Ability of an ally that faints. Abilities that cannot be copied are \"No Ability\", As One, Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Gulp Missile, Hunger Switch, Ice Face, Illusion, Imposter, Multitype, Neutralizing Gas, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, Wonder Guard, and Zen Mode.","shortDescription":"This Pokemon copies the Ability of an ally that faints.","gen":[8]},{"name":"Reckless","description":"This Pokemon's attacks with recoil or crash damage have their power multiplied by 1.2. Does not affect Struggle.","shortDescription":"This Pokemon's attacks with recoil or crash damage have 1.2x power; not Struggle.","gen":[4,5,6,7,8]},{"name":"Refrigerate","description":"This Pokemon's Normal-type moves become Ice-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Ice type and have 1.3x power.","gen":[6]},{"name":"Refrigerate","description":"This Pokemon's Normal-type moves become Ice-type moves and have their power multiplied by 1.2. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.","shortDescription":"This Pokemon's Normal-type moves become Ice type and have 1.2x power.","gen":[7,8]},{"name":"Regenerator","description":"This Pokemon restores 1/3 of its maximum HP, rounded down, when it switches out.","shortDescription":"This Pokemon restores 1/3 of its maximum HP, rounded down, when it switches out.","gen":[5,6,7,8]},{"name":"Ripen","description":"When this Pokemon eats a Berry, its effect is doubled.","shortDescription":"When this Pokemon eats a Berry, its effect is doubled.","gen":[8]},{"name":"Rivalry","description":"This Pokemon's attacks have their power multiplied by 1.25 against targets of the same gender or multiplied by 0.75 against targets of the opposite gender. There is no modifier if either this Pokemon or the target is genderless.","shortDescription":"This Pokemon's attacks do 1.25x on same gender targets; 0.75x on opposite gender.","gen":[4,5,6,7,8]},{"name":"RKS System","description":"If this Pokemon is a Silvally, its type changes to match its held Memory.","shortDescription":"If this Pokemon is a Silvally, its type changes to match its held Memory.","gen":[7,8]},{"name":"Rock Head","description":"This Pokemon does not take recoil damage besides Struggle, Life Orb, and crash damage.","shortDescription":"This Pokemon does not take recoil damage besides Struggle/Life Orb/crash damage.","gen":[3,4,5,6,7,8]},{"name":"Rough Skin","description":"Pokemon making contact with this Pokemon lose 1/16 of their maximum HP, rounded down. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"Pokemon making contact with this Pokemon lose 1/16 of their max HP.","gen":[3]},{"name":"Rough Skin","description":"Pokemon making contact with this Pokemon lose 1/8 of their maximum HP, rounded down.","shortDescription":"Pokemon making contact with this Pokemon lose 1/8 of their max HP.","gen":[4,5,6,7,8]},{"name":"Run Away","description":"No competitive use.","shortDescription":"No competitive use.","gen":[3,4,5,6,7,8]},{"name":"Sand Force","description":"If Sandstorm is active, this Pokemon's Ground-, Rock-, and Steel-type attacks have their power multiplied by 1.3. This Pokemon takes no damage from Sandstorm.","shortDescription":"This Pokemon's Ground/Rock/Steel attacks do 1.3x in Sandstorm; immunity to it.","gen":[5,6,7,8]},{"name":"Sand Rush","description":"If Sandstorm is active, this Pokemon's Speed is doubled. This Pokemon takes no damage from Sandstorm.","shortDescription":"If Sandstorm is active, this Pokemon's Speed is doubled; immunity to Sandstorm.","gen":[5,6,7,8]},{"name":"Sand Spit","description":"When this Pokemon is hit by an attack, Sandstorm begins. This effect happens after the effects of Max and G-Max Moves.","shortDescription":"When this Pokemon is hit, Sandstorm begins.","gen":[8]},{"name":"Sand Stream","description":"On switch-in, this Pokemon summons Sandstorm.","shortDescription":"On switch-in, this Pokemon summons Sandstorm.","gen":[3,4,5,6,7,8]},{"name":"Sand Veil","description":"If Sandstorm is active, this Pokemon's evasiveness is multiplied by 1.25. This Pokemon takes no damage from Sandstorm.","shortDescription":"If Sandstorm is active, this Pokemon's evasiveness is 1.25x; immunity to Sandstorm.","gen":[3,4,5,6,7,8]},{"name":"Sap Sipper","description":"This Pokemon is immune to Grass-type moves and raises its Attack by 1 stage when hit by a Grass-type move.","shortDescription":"This Pokemon's Attack is raised 1 stage if hit by a Grass move; Grass immunity.","gen":[5,6,7,8]},{"name":"Schooling","description":"On switch-in, if this Pokemon is a Wishiwashi that is level 20 or above and has more than 1/4 of its maximum HP left, it changes to School Form. If it is in School Form and its HP drops to 1/4 of its maximum HP or less, it changes to Solo Form at the end of the turn. If it is in Solo Form and its HP is greater than 1/4 its maximum HP at the end of the turn, it changes to School Form.","shortDescription":"If user is Wishiwashi, changes to School Form if it has > 1/4 max HP, else Solo Form.","gen":[7,8]},{"name":"Scrappy","description":"This Pokemon can hit Ghost types with Normal- and Fighting-type moves.","shortDescription":"This Pokemon can hit Ghost types with Normal- and Fighting-type moves.","gen":[7]},{"name":"Scrappy","description":"This Pokemon can hit Ghost types with Normal- and Fighting-type moves. Immune to Intimidate.","shortDescription":"Fighting, Normal moves hit Ghost. Immune to Intimidate.","gen":[8]},{"name":"Screen Cleaner","description":"On switch-in, the effects of Aurora Veil, Light Screen, and Reflect end for both sides.","shortDescription":"On switch-in, the effects of Aurora Veil, Light Screen, and Reflect end for both sides.","gen":[8]},{"name":"Serene Grace","description":"This Pokemon's moves have their secondary effect chance doubled.","shortDescription":"This Pokemon's moves have their secondary effect chance doubled.","gen":[3,4,5,6,7,8]},{"name":"Shadow Shield","description":"If this Pokemon is at full HP, damage taken from attacks is halved. Moongeist Beam, Sunsteel Strike, and the Mold Breaker, Teravolt, and Turboblaze Abilities cannot ignore this Ability.","shortDescription":"If this Pokemon is at full HP, damage taken from attacks is halved.","gen":[7,8]},{"name":"Shadow Tag","description":"Prevents opposing Pokemon from choosing to switch out.","shortDescription":"Prevents opposing Pokemon from choosing to switch out.","gen":[3]},{"name":"Shadow Tag","description":"Prevents adjacent opposing Pokemon from choosing to switch out unless they are immune to trapping or also have this Ability.","shortDescription":"Prevents adjacent foes from choosing to switch unless they also have this Ability.","gen":[4,5,6,7,8]},{"name":"Shed Skin","description":"This Pokemon has a 33% chance to have its non-volatile status condition cured at the end of each turn.","shortDescription":"This Pokemon has a 33% chance to have its status cured at the end of each turn.","gen":[3,4,5,6,7,8]},{"name":"Sheer Force","description":"This Pokemon's attacks with secondary effects have their power multiplied by 1.3, but the secondary effects are removed. If a secondary effect was removed, it also removes the user's Life Orb recoil and Shell Bell recovery, and prevents the target's Color Change, Pickpocket, Red Card, and Eject Button from activating.","shortDescription":null,"gen":[5]},{"name":"Sheer Force","description":"This Pokemon's attacks with secondary effects have their power multiplied by 1.3, but the secondary effects are removed. If a secondary effect was removed, it also removes the user's Life Orb recoil and Shell Bell recovery, and prevents the target's Color Change, Pickpocket, Red Card, Eject Button, Kee Berry, and Maranga Berry from activating.","shortDescription":null,"gen":[6]},{"name":"Sheer Force","description":"This Pokemon's attacks with secondary effects have their power multiplied by 1.3, but the secondary effects are removed. If a secondary effect was removed, it also removes the user's Life Orb recoil and Shell Bell recovery, and prevents the target's Berserk, Color Change, Emergency Exit, Pickpocket, Wimp Out, Red Card, Eject Button, Kee Berry, and Maranga Berry from activating.","shortDescription":"This Pokemon's attacks with secondary effects have 1.3x power; nullifies the effects.","gen":[7,8]},{"name":"Shell Armor","description":"This Pokemon cannot be struck by a critical hit.","shortDescription":"This Pokemon cannot be struck by a critical hit.","gen":[3,4,5,6,7,8]},{"name":"Shield Dust","description":"This Pokemon is not affected by the secondary effect of another Pokemon's attack.","shortDescription":"This Pokemon is not affected by the secondary effect of another Pokemon's attack.","gen":[3,4,5,6,7,8]},{"name":"Shields Down","description":"If this Pokemon is a Minior, it changes to its Core forme if it has 1/2 or less of its maximum HP, and changes to Meteor Form if it has more than 1/2 its maximum HP. This check is done on switch-in and at the end of each turn. While in its Meteor Form, it cannot become affected by non-volatile status conditions. Moongeist Beam, Sunsteel Strike, and the Mold Breaker, Teravolt, and Turboblaze Abilities cannot ignore this Ability.","shortDescription":"If Minior, switch-in/end of turn it changes to Core at 1/2 max HP or less, else Meteor.","gen":[7,8]},{"name":"Simple","description":"This Pokemon's stat stages are considered doubled during stat calculations.","shortDescription":"This Pokemon's stat stages are considered doubled during stat calculations.","gen":[4,5]},{"name":"Simple","description":"When this Pokemon's stat stages are raised or lowered, the effect is doubled instead.","shortDescription":"This Pokemon's stat stages are considered doubled during stat calculations.","gen":[6]},{"name":"Simple","description":"When this Pokemon's stat stages are raised or lowered, the effect is doubled instead. This Ability does not affect stat stage increases received from Z-Power effects that happen before a Z-Move is used.","shortDescription":"When this Pokemon's stat stages are raised or lowered, the effect is doubled instead.","gen":[7,8]},{"name":"Skill Link","description":"This Pokemon's multi-hit attacks always hit the maximum number of times.","shortDescription":"This Pokemon's multi-hit attacks always hit the maximum number of times.","gen":[4,5,6,7,8]},{"name":"Slow Start","description":"On switch-in, this Pokemon's Attack and Speed are halved for 5 turns.","shortDescription":"On switch-in, this Pokemon's Attack and Speed are halved for 5 turns.","gen":[4,5,6,7,8]},{"name":"Slush Rush","description":"If Hail is active, this Pokemon's Speed is doubled.","shortDescription":"If Hail is active, this Pokemon's Speed is doubled.","gen":[7,8]},{"name":"Sniper","description":"If this Pokemon strikes with a critical hit, the damage is multiplied by 1.5.","shortDescription":"If this Pokemon strikes with a critical hit, the damage is multiplied by 1.5.","gen":[4,5,6,7,8]},{"name":"Snow Cloak","description":"If Hail is active, this Pokemon's evasiveness is multiplied by 1.25. This Pokemon takes no damage from Hail.","shortDescription":"If Hail is active, this Pokemon's evasiveness is 1.25x; immunity to Hail.","gen":[4,5,6,7,8]},{"name":"Snow Warning","description":"On switch-in, this Pokemon summons Hail.","shortDescription":"On switch-in, this Pokemon summons Hail.","gen":[4,5,6,7,8]},{"name":"Solar Power","description":"If Sunny Day is active, this Pokemon's Special Attack is multiplied by 1.5 and it loses 1/8 of its maximum HP, rounded down, at the end of each turn.","shortDescription":null,"gen":[7]},{"name":"Solar Power","description":"If Sunny Day is active, this Pokemon's Special Attack is multiplied by 1.5 and it loses 1/8 of its maximum HP, rounded down, at the end of each turn. If this Pokemon is holding Utility Umbrella, its Special Attack remains the same and it does not lose any HP.","shortDescription":"If Sunny Day is active, this Pokemon's Sp. Atk is 1.5x; loses 1/8 max HP per turn.","gen":[8]},{"name":"Solid Rock","description":"This Pokemon receives 3/4 damage from supereffective attacks.","shortDescription":"This Pokemon receives 3/4 damage from supereffective attacks.","gen":[4,5,6,7,8]},{"name":"Soul-Heart","description":"This Pokemon's Special Attack is raised by 1 stage when another Pokemon faints.","shortDescription":"This Pokemon's Sp. Atk is raised by 1 stage when another Pokemon faints.","gen":[7,8]},{"name":"Soundproof","description":"This Pokemon is immune to sound-based moves, including Heal Bell.","shortDescription":"This Pokemon is immune to sound-based moves, including Heal Bell.","gen":[4]},{"name":"Soundproof","description":"This Pokemon is immune to sound-based moves, except Heal Bell.","shortDescription":"This Pokemon is immune to sound-based moves, except Heal Bell.","gen":[5]},{"name":"Soundproof","description":"This Pokemon is immune to sound-based moves, including Heal Bell.","shortDescription":"This Pokemon is immune to sound-based moves, including Heal Bell.","gen":[6,7,8]},{"name":"Speed Boost","description":"This Pokemon's Speed is raised by 1 stage at the end of each full turn it has been on the field.","shortDescription":"This Pokemon's Speed is raised 1 stage at the end of each full turn on the field.","gen":[3,4,5,6,7,8]},{"name":"Stakeout","description":"This Pokemon's attacking stat is doubled against a target that switched in this turn.","shortDescription":"This Pokemon's attacking stat is doubled against a target that switched in this turn.","gen":[7,8]},{"name":"Stall","description":"This Pokemon moves last among Pokemon using the same or greater priority moves.","shortDescription":"This Pokemon moves last among Pokemon using the same or greater priority moves.","gen":[4,5,6,7,8]},{"name":"Stalwart","description":"This Pokemon's moves cannot be redirected to a different target by any effect.","shortDescription":"This Pokemon's moves cannot be redirected to a different target by any effect.","gen":[8]},{"name":"Stamina","description":"This Pokemon's Defense is raised by 1 stage after it is damaged by a move.","shortDescription":"This Pokemon's Defense is raised by 1 stage after it is damaged by a move.","gen":[7,8]},{"name":"Stance Change","description":"If this Pokemon is an Aegislash, it changes to Blade Forme before attempting to use an attacking move, and changes to Shield Forme before attempting to use King's Shield.","shortDescription":"If Aegislash, changes Forme to Blade before attacks and Shield before King's Shield.","gen":[6,7,8]},{"name":"Static","description":"1/3 chance a Pokemon making contact with this Pokemon will be paralyzed. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be paralyzed.","gen":[3]},{"name":"Static","description":"30% chance a Pokemon making contact with this Pokemon will be paralyzed. This effect does not happen if this Pokemon did not lose HP from the attack.","shortDescription":"1/3 chance a Pokemon making contact with this Pokemon will be paralyzed.","gen":[4]},{"name":"Static","description":"30% chance a Pokemon making contact with this Pokemon will be paralyzed.","shortDescription":"30% chance a Pokemon making contact with this Pokemon will be paralyzed.","gen":[5,6,7,8]},{"name":"Steadfast","description":"If this Pokemon flinches, its Speed is raised by 1 stage.","shortDescription":"If this Pokemon flinches, its Speed is raised by 1 stage.","gen":[4,5,6,7,8]},{"name":"Steam Engine","description":"This Pokemon's Speed is raised by 6 stages after it is damaged by Fire/Water moves.","shortDescription":"This Pokemon's Speed is raised by 6 stages after it is damaged by Fire/Water moves.","gen":[8]},{"name":"Steelworker","description":"This Pokemon's attacking stat is multiplied by 1.5 while using a Steel-type attack.","shortDescription":"This Pokemon's attacking stat is multiplied by 1.5 while using a Steel-type attack.","gen":[7,8]},{"name":"Steely Spirit","description":"This Pokemon and its allies' Steel-type moves have their power multiplied by 1.5.","shortDescription":"This Pokemon and its allies' Steel-type moves have their power multiplied by 1.5.","gen":[8]},{"name":"Stench","description":"No competitive use.","shortDescription":"No competitive use.","gen":[4]},{"name":"Stench","description":"This Pokemon's attacks without a chance to make the target flinch gain a 10% chance to make the target flinch.","shortDescription":"This Pokemon's attacks without a chance to flinch gain a 10% chance to flinch.","gen":[5,6,7,8]},{"name":"Sticky Hold","description":"This Pokemon cannot lose its held item due to another Pokemon's attack.","shortDescription":"This Pokemon cannot lose its held item due to another Pokemon's attack.","gen":[4,5,6,7,8]},{"name":"Storm Drain","description":"If this Pokemon is not the target of a single-target Water-type move used by another Pokemon, this Pokemon redirects that move to itself.","shortDescription":"This Pokemon draws single-target Water moves to itself.","gen":[4]},{"name":"Storm Drain","description":"This Pokemon is immune to Water-type moves and raises its Special Attack by 1 stage when hit by a Water-type move. If this Pokemon is not the target of a single-target Water-type move used by another Pokemon, this Pokemon redirects that move to itself if it is within the range of that move.","shortDescription":"This Pokemon draws Water moves to itself to raise Sp. Atk by 1; Water immunity.","gen":[5,6,7,8]},{"name":"Strong Jaw","description":"This Pokemon's bite-based attacks have their power multiplied by 1.5.","shortDescription":"This Pokemon's bite-based attacks have 1.5x power. Bug Bite is not boosted.","gen":[6,7,8]},{"name":"Sturdy","description":"OHKO moves fail when used against this Pokemon.","shortDescription":"OHKO moves fail when used against this Pokemon.","gen":[4]},{"name":"Sturdy","description":"If this Pokemon is at full HP, it survives one hit with at least 1 HP. OHKO moves fail when used against this Pokemon.","shortDescription":"If this Pokemon is at full HP, it survives one hit with at least 1 HP. Immune to OHKO.","gen":[5,6,7,8]},{"name":"Suction Cups","description":"This Pokemon cannot be forced to switch out by another Pokemon's attack or item.","shortDescription":"This Pokemon cannot be forced to switch out by another Pokemon's attack or item.","gen":[3,4,5,6,7,8]},{"name":"Super Luck","description":"This Pokemon's critical hit ratio is raised by 1 stage.","shortDescription":"This Pokemon's critical hit ratio is raised by 1 stage.","gen":[4,5,6,7,8]},{"name":"Surge Surfer","description":"If Electric Terrain is active, this Pokemon's Speed is doubled.","shortDescription":"If Electric Terrain is active, this Pokemon's Speed is doubled.","gen":[7,8]},{"name":"Swarm","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its Bug-type attacks have their power multiplied by 1.5.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's Bug-type attacks have 1.5x power.","gen":[4]},{"name":"Swarm","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Bug-type attack.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's attacking stat is 1.5x with Bug attacks.","gen":[5,6,7,8]},{"name":"Sweet Veil","description":"This Pokemon and its allies cannot fall asleep.","shortDescription":"This Pokemon and its allies cannot fall asleep.","gen":[6,7,8]},{"name":"Swift Swim","description":"If Rain Dance is active, this Pokemon's Speed is doubled.","shortDescription":null,"gen":[7]},{"name":"Swift Swim","description":"If Rain Dance is active and this Pokemon is not holding Utility Umbrella, this Pokemon's Speed is doubled.","shortDescription":"If Rain Dance is active, this Pokemon's Speed is doubled.","gen":[8]},{"name":"Symbiosis","description":"If an ally uses its item, this Pokemon gives its item to that ally immediately. Does not activate if the ally's item was stolen or knocked off.","shortDescription":"If an ally uses its item, this Pokemon gives its item to that ally immediately.","gen":[6,7,8]},{"name":"Synchronize","description":"If another Pokemon burns, paralyzes, or poisons this Pokemon, that Pokemon receives the same non-volatile status condition. If another Pokemon badly poisons this Pokemon, that Pokemon becomes poisoned.","shortDescription":null,"gen":[4]},{"name":"Synchronize","description":"If another Pokemon burns, paralyzes, poisons, or badly poisons this Pokemon, that Pokemon receives the same non-volatile status condition.","shortDescription":"If another Pokemon burns/poisons/paralyzes this Pokemon, it also gets that status.","gen":[5,6,7,8]},{"name":"Tangled Feet","description":"This Pokemon's evasiveness is doubled as long as it is confused.","shortDescription":"This Pokemon's evasiveness is doubled as long as it is confused.","gen":[4,5,6,7,8]},{"name":"Tangling Hair","description":"Pokemon making contact with this Pokemon have their Speed lowered by 1 stage.","shortDescription":"Pokemon making contact with this Pokemon have their Speed lowered by 1 stage.","gen":[7,8]},{"name":"Technician","description":"This Pokemon's moves of 60 power or less have their power multiplied by 1.5. Does affect Struggle.","shortDescription":"This Pokemon's moves of 60 power or less have 1.5x power. Includes Struggle.","gen":[4,5,6,7,8]},{"name":"Telepathy","description":"This Pokemon does not take damage from attacks made by its allies.","shortDescription":"This Pokemon does not take damage from attacks made by its allies.","gen":[5,6,7,8]},{"name":"Teravolt","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Battle Armor, Big Pecks, Clear Body, Contrary, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Friend Guard, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[5]},{"name":"Teravolt","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[6]},{"name":"Teravolt","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[7]},{"name":"Teravolt","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Ice Face, Ice Scales, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Mirror Armor, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Pastel Veil, Punk Rock, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":"This Pokemon's moves and their effects ignore the Abilities of other Pokemon.","gen":[8]},{"name":"Thick Fat","description":"The power of Fire- and Ice-type attacks against this Pokemon is halved.","shortDescription":"The power of Fire- and Ice-type attacks against this Pokemon is halved.","gen":[4]},{"name":"Thick Fat","description":"If a Pokemon uses a Fire- or Ice-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon.","shortDescription":"Fire/Ice-type moves against this Pokemon deal damage with a halved attacking stat.","gen":[5,6,7,8]},{"name":"Tinted Lens","description":"This Pokemon's attacks that are not very effective on a target deal double damage.","shortDescription":"This Pokemon's attacks that are not very effective on a target deal double damage.","gen":[4,5,6,7,8]},{"name":"Torrent","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its Water-type attacks have their power multiplied by 1.5.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's Water-type attacks have 1.5x power.","gen":[4]},{"name":"Torrent","description":"When this Pokemon has 1/3 or less of its maximum HP, rounded down, its attacking stat is multiplied by 1.5 while using a Water-type attack.","shortDescription":"At 1/3 or less of its max HP, this Pokemon's attacking stat is 1.5x with Water attacks.","gen":[5,6,7,8]},{"name":"Tough Claws","description":"This Pokemon's contact moves have their power multiplied by 1.3.","shortDescription":"This Pokemon's contact moves have their power multiplied by 1.3.","gen":[6,7,8]},{"name":"Toxic Boost","description":"While this Pokemon is poisoned, the power of its physical attacks is multiplied by 1.5.","shortDescription":"While this Pokemon is poisoned, its physical attacks have 1.5x power.","gen":[5,6,7,8]},{"name":"Trace","description":"On switch-in, or when this Pokemon acquires this ability, this Pokemon copies a random adjacent opposing Pokemon's Ability. However, if one or more adjacent Pokemon has the Ability \"No Ability\", Trace won't copy anything even if there is another valid Ability it could normally copy. Otherwise, if there is no Ability that can be copied at that time, this Ability will activate as soon as an Ability can be copied. Abilities that cannot be copied are the previously mentioned \"No Ability\", as well as Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Illusion, Imposter, Multitype, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, and Zen Mode.","shortDescription":null,"gen":[7]},{"name":"Trace","description":"On switch-in, or when this Pokemon acquires this ability, this Pokemon copies a random adjacent opposing Pokemon's Ability. However, if one or more adjacent Pokemon has the Ability \"No Ability\", Trace won't copy anything even if there is another valid Ability it could normally copy. Otherwise, if there is no Ability that can be copied at that time, this Ability will activate as soon as an Ability can be copied. Abilities that cannot be copied are the previously mentioned \"No Ability\", as well as As One, Battle Bond, Comatose, Disguise, Flower Gift, Forecast, Gulp Missile, Hunger Switch, Ice Face, Illusion, Imposter, Multitype, Neutralizing Gas, Power Construct, Power of Alchemy, Receiver, RKS System, Schooling, Shields Down, Stance Change, Trace, and Zen Mode.","shortDescription":"On switch-in, or when it can, this Pokemon copies a random adjacent foe's Ability.","gen":[8]},{"name":"Transistor","description":"This Pokemon's attacking stat is multiplied by 1.5 while using an Electric-type attack.","shortDescription":"This Pokemon's attacking stat is multiplied by 1.5 while using an Electric-type attack.","gen":[8]},{"name":"Triage","description":"This Pokemon's healing moves have their priority increased by 3.","shortDescription":"This Pokemon's healing moves have their priority increased by 3.","gen":[7,8]},{"name":"Truant","description":"This Pokemon skips every other turn instead of using a move.","shortDescription":"This Pokemon skips every other turn instead of using a move.","gen":[3,4,5,6,7,8]},{"name":"Turboblaze","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Battle Armor, Big Pecks, Clear Body, Contrary, Damp, Dry Skin, Filter, Flash Fire, Flower Gift, Friend Guard, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[5]},{"name":"Turboblaze","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[6]},{"name":"Turboblaze","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":null,"gen":[7]},{"name":"Turboblaze","description":"This Pokemon's moves and their effects ignore certain Abilities of other Pokemon. The Abilities that can be negated are Aroma Veil, Aura Break, Battle Armor, Big Pecks, Bulletproof, Clear Body, Contrary, Damp, Dark Aura, Dazzling, Disguise, Dry Skin, Fairy Aura, Filter, Flash Fire, Flower Gift, Flower Veil, Fluffy, Friend Guard, Fur Coat, Grass Pelt, Heatproof, Heavy Metal, Hyper Cutter, Ice Face, Ice Scales, Immunity, Inner Focus, Insomnia, Keen Eye, Leaf Guard, Levitate, Light Metal, Lightning Rod, Limber, Magic Bounce, Magma Armor, Marvel Scale, Mirror Armor, Motor Drive, Multiscale, Oblivious, Overcoat, Own Tempo, Pastel Veil, Punk Rock, Queenly Majesty, Sand Veil, Sap Sipper, Shell Armor, Shield Dust, Simple, Snow Cloak, Solid Rock, Soundproof, Sticky Hold, Storm Drain, Sturdy, Suction Cups, Sweet Veil, Tangled Feet, Telepathy, Thick Fat, Unaware, Vital Spirit, Volt Absorb, Water Absorb, Water Bubble, Water Veil, White Smoke, Wonder Guard, and Wonder Skin. This affects every other Pokemon on the field, whether or not it is a target of this Pokemon's move, and whether or not their Ability is beneficial to this Pokemon.","shortDescription":"This Pokemon's moves and their effects ignore the Abilities of other Pokemon.","gen":[8]},{"name":"Unaware","description":"This Pokemon ignores other Pokemon's Attack, Special Attack, and accuracy stat stages when taking damage, and ignores other Pokemon's Defense, Special Defense, and evasiveness stat stages when dealing damage.","shortDescription":"This Pokemon ignores other Pokemon's stat stages when taking or doing damage.","gen":[4,5,6,7,8]},{"name":"Unburden","description":"If this Pokemon loses its held item for any reason, its Speed is doubled. This boost is lost if it switches out or gains a new item or Ability.","shortDescription":"Speed is doubled on held item loss; boost is lost if it switches, gets new item/Ability.","gen":[4,5,6,7,8]},{"name":"Unnerve","description":"While this Pokemon is active, it prevents opposing Pokemon from using their Berries. Activation message broadcasts before other Abilities regardless of the Pokemon's Speed tiers.","shortDescription":"While this Pokemon is active, it prevents opposing Pokemon from using their Berries.","gen":[5,6,7,8]},{"name":"Unseen Fist","description":"All of this Pokemon's moves that make contact bypass protection.","shortDescription":"All contact moves hit through protection.","gen":[8]},{"name":"Victory Star","description":"This Pokemon and its allies' moves have their accuracy multiplied by 1.1.","shortDescription":"This Pokemon and its allies' moves have their accuracy multiplied by 1.1.","gen":[5,6,7,8]},{"name":"Vital Spirit","description":"This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it.","shortDescription":"This Pokemon cannot fall asleep. Gaining this Ability while asleep cures it.","gen":[3,4,5,6,7,8]},{"name":"Volt Absorb","description":"This Pokemon is immune to damaging Electric-type moves and restores 1/4 of its maximum HP, rounded down, when hit by one.","shortDescription":"This Pokemon heals 1/4 its max HP when hit by a damaging Electric move; immunity.","gen":[3]},{"name":"Volt Absorb","description":"This Pokemon is immune to Electric-type moves and restores 1/4 of its maximum HP, rounded down, when hit by an Electric-type move.","shortDescription":"This Pokemon heals 1/4 of its max HP when hit by Electric moves; Electric immunity.","gen":[4,5,6,7,8]},{"name":"Wandering Spirit","description":"Pokemon making contact with this Pokemon have their Ability swapped with this one. Does not affect a Pokemon which has the Ability As One, Battle Bond, Comatose, Disguise, Gulp Missile, Hunger Switch, Ice Face, Illusion, Multitype, Neutralizing Gas, Power Construct, RKS System, Schooling, Shields Down, Stance Change, or Zen Mode.","shortDescription":"Pokemon making contact with this Pokemon have their Ability swapped with this one.","gen":[8]},{"name":"Water Absorb","description":"This Pokemon is immune to Water-type moves and restores 1/4 of its maximum HP, rounded down, when hit by a Water-type move.","shortDescription":"This Pokemon heals 1/4 of its max HP when hit by Water moves; Water immunity.","gen":[3,4,5,6,7,8]},{"name":"Water Bubble","description":"This Pokemon's attacking stat is doubled while using a Water-type attack. If a Pokemon uses a Fire-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon. This Pokemon cannot be burned. Gaining this Ability while burned cures it.","shortDescription":"This Pokemon's Water power is 2x; it can't be burned; Fire power against it is halved.","gen":[7,8]},{"name":"Water Compaction","description":"This Pokemon's Defense is raised 2 stages after it is damaged by a Water-type move.","shortDescription":"This Pokemon's Defense is raised 2 stages after it is damaged by a Water-type move.","gen":[7,8]},{"name":"Water Veil","description":"This Pokemon cannot be burned. Gaining this Ability while burned cures it.","shortDescription":"This Pokemon cannot be burned. Gaining this Ability while burned cures it.","gen":[3,4,5,6,7,8]},{"name":"Weak Armor","description":"If a physical attack hits this Pokemon, its Defense is lowered by 1 stage and its Speed is raised by 1 stage.","shortDescription":"If a physical attack hits this Pokemon, Defense is lowered by 1, Speed is raised by 1.","gen":[6]},{"name":"Weak Armor","description":"If a physical attack hits this Pokemon, its Defense is lowered by 1 stage and its Speed is raised by 2 stages.","shortDescription":"If a physical attack hits this Pokemon, Defense is lowered by 1, Speed is raised by 2.","gen":[7,8]},{"name":"White Smoke","description":"Prevents other Pokemon from lowering this Pokemon's stat stages.","shortDescription":"Prevents other Pokemon from lowering this Pokemon's stat stages.","gen":[3,4,5,6,7,8]},{"name":"Wimp Out","description":"When this Pokemon has more than 1/2 its maximum HP and takes damage bringing it to 1/2 or less of its maximum HP, it immediately switches out to a chosen ally. This effect applies after all hits from a multi-hit move; Sheer Force prevents it from activating if the move has a secondary effect. This effect applies to both direct and indirect damage, except Curse and Substitute on use, Belly Drum, Pain Split, and confusion damage.","shortDescription":"This Pokemon switches out when it reaches 1/2 or less of its maximum HP.","gen":[7,8]},{"name":"Wonder Guard","description":"This Pokemon is only damaged by supereffective moves and indirect damage.","shortDescription":"This Pokemon is only damaged by supereffective moves and indirect damage.","gen":[3]},{"name":"Wonder Guard","description":"This Pokemon is only damaged by Fire Fang, supereffective moves, indirect damage.","shortDescription":"This Pokemon is only damaged by Fire Fang, supereffective moves, indirect damage.","gen":[4]},{"name":"Wonder Guard","description":"This Pokemon can only be damaged by supereffective moves and indirect damage.","shortDescription":"This Pokemon can only be damaged by supereffective moves and indirect damage.","gen":[5,6,7,8]},{"name":"Wonder Skin","description":"All non-damaging moves that check accuracy have their accuracy changed to 50% when used on this Pokemon. This change is done before any other accuracy modifying effects.","shortDescription":"Status moves with accuracy checks are 50% accurate when used on this Pokemon.","gen":[5,6,7,8]},{"name":"Zen Mode","description":"If this Pokemon is a Darmanitan, it changes to Zen Mode if it has 1/2 or less of its maximum HP at the end of a turn. If Darmanitan's HP is above 1/2 of its maximum HP at the end of a turn, it changes back to Standard Mode. If Darmanitan loses this Ability while in Zen Mode, it reverts to Standard Mode immediately.","shortDescription":null,"gen":[6]},{"name":"Zen Mode","description":"If this Pokemon is a Darmanitan or Darmanitan-Galar, it changes to Zen Mode if it has 1/2 or less of its maximum HP at the end of a turn. If Darmanitan's HP is above 1/2 of its maximum HP at the end of a turn, it changes back to Standard Mode. This Ability cannot be removed or suppressed.","shortDescription":"If Darmanitan, at end of turn changes Mode to Standard if > 1/2 max HP, else Zen.","gen":[7,8]}]